redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_i2s.c
/****************************************************************************
 * arch/arm/src/nrf52/nrf52_i2s.c
 *
 *   Copyright (C) 2018 zGlue Inc. All rights reserved.
 *   Author: Zhengwei Wang <zhengwei@zglue.com>
 *
 * References:
 *
 * -  The framework for this driver is based on stm32l4 sai driver
 *    written by Gregory Nutt.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <semaphore.h>
#include <errno.h>
#include <assert.h>
#include <queue.h>
#include <debug.h>

#include <arch/board/board.h>

#include <nuttx/irq.h>
#include <nuttx/kmalloc.h>
#include <nuttx/clock.h>
#include <nuttx/wqueue.h>
#include <nuttx/fs/fs.h>
#include <nuttx/fs/ioctl.h>
#include <nuttx/audio/audio.h>

#include <arch/board/board.h>


#include "chip.h"
#include "nrf.h"
#include "nrf_i2s.h"
#include "nrf_gpio.h"
#include "nrf52_gpio.h"
#include "nrf52_i2s.h"

#ifdef CONFIG_NRF52_I2S

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifndef CONFIG_SCHED_WORKQUEUE
#  error Work queue support is required (CONFIG_SCHED_WORKQUEUE)
#endif

#ifndef CONFIG_AUDIO
#  error CONFIG_AUDIO required by this driver
#endif

#ifndef CONFIG_I2S
#  error CONFIG_I2S required by this driver
#endif

#ifndef CONFIG_NRF52_I2S_DEFAULT_SAMPLERATE
#  define CONFIG_NRF52_I2S_DEFAULT_SAMPLERATE  (48000)
#endif

#ifndef CONFIG_NRF52_I2S_DEFAULT_DATALEN
#  define CONFIG_NRF52_I2S_DEFAULT_DATALEN     (16)
#endif

#ifndef CONFIG_NRF52_I2S_DEFAULT_CHANNEL
#  define CONFIG_NRF52_I2S_DEFAULT_CHANNEL     (2)
#endif


#ifndef CONFIG_NRF52_I2S_MAXINFLIGHT
#  define CONFIG_NRF52_I2S_MAXINFLIGHT         (16)
#endif

#define NRF52_I2S_DATA_ALIGN 3

#define EVT_TO_STR(event)   (event == NRF_I2S_EVENT_RXPTRUPD ? "NRF_I2S_EVENT_RXPTRUPD" :                \
                            (event == NRF_I2S_EVENT_TXPTRUPD ? "NRF_I2S_EVENT_TXPTRUPD" :                \
                            (event == NRF_I2S_EVENT_STOPPED ? "NRF_I2S_EVENT_STOPPED" : "UNKNOWN EVENT")))


/****************************************************************************
 * Private Types
 ****************************************************************************/

/* I2S buffer container */

struct i2s_buffer_s
{
  struct i2s_buffer_s *flink;  /* Supports a singly linked list */
  i2s_callback_t callback;     /* Function to call when the transfer completes */
  uint32_t timeout;            /* The timeout value to use with transfers */
  void *arg;                   /* The argument to be returned with the callback */
  struct ap_buffer_s *apb;     /* The audio buffer */
  int result;                  /* The result of the transfer */
};


/* The state of the one I2S peripheral */

struct nrf52_i2s_s
{
  struct i2s_dev_s dev;        /* Externally visible I2S interface */
  sem_t exclsem;               /* Assures mutually exclusive acess to i2s */
  sq_queue_t pend;             /* A queue of pending transfers */
  sq_queue_t done;             /* A queue of completed transfers */
  struct work_s work;          /* this work will clear all apb buffers in the done queue */

  /* I2S setting */

  uint8_t datalen;             /* Data width */
  uint8_t channel;             /* mono or stereo */
  uint8_t channel_setted;      /* new setted channel number */
  uint32_t samplerate;         /* Data sample rate */
  const struct nrf52_i2s_clk_s *clk_config_current;/*pointer to the current clock config*/
  const struct nrf52_i2s_clk_s *clk_config_setted;/*pointer to the new setted clock config*/
  bool rxenab;            /* True: RX transfers enabled */
  bool txenab;            /* True: TX transfers enabled */


  /* Pre-allocated pool of buffer containers */

  sem_t bufsem;                   /* Buffer wait semaphore */
  struct i2s_buffer_s *freelist;  /* A list a free buffer containers */
  struct i2s_buffer_s containers[CONFIG_NRF52_I2S_MAXINFLIGHT];
  struct i2s_buffer_s *ended;/*point to the apb_buffer that has been successfully sended or received just now*/
  struct i2s_buffer_s *transmitting;/*point to the apb_buffer that is now being transmitting by the i2s*/
  struct i2s_buffer_s *loaded;/*point to the apb_buffer that has been just handded over to i2s peripheral*/
};

