redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_i2s.c
struct nrf52_i2s_clk_s
{
  uint32_t samplerate;
  uint8_t  samplewidth;
  nrf_i2s_swidth_t swidth;
  nrf_i2s_mck_t mck;
  nrf_i2s_ratio_t ratio;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Semaphore helpers */

static void     nrf52_i2s_exclsem_take(struct nrf52_i2s_s *priv);
#define         nrf52_i2s_exclsem_give(priv) sem_post(&priv->exclsem)

static void     nrf52_i2s_bufsem_take(struct nrf52_i2s_s *priv);
#define         nrf52_i2s_bufsem_give(priv) sem_post(&priv->bufsem)

/* Buffer container helpers */

static struct i2s_buffer_s *
nrf52_i2s_buf_allocate(struct nrf52_i2s_s *priv);
static void     nrf52_i2s_buf_free(struct nrf52_i2s_s *priv,
                                   struct i2s_buffer_s *bfcontainer);
static void     nrf52_i2s_buf_initialize(struct nrf52_i2s_s *priv);

/*interrupt handler*/

static void     nrf52_i2s_schedule(struct nrf52_i2s_s *priv, int result);
static int      nrf52_i2s_interrupt(int irq, FAR void *context, FAR void *arg);

/*i2s config handlers*/

static int nrf52_i2s_setbitrate(struct nrf52_i2s_s *priv,
                                uint32_t samplerate, uint8_t samplewidth);



/* I2S methods */

static uint32_t nrf52_i2s_samplerate(struct i2s_dev_s *dev, uint32_t rate);
static uint32_t nrf52_i2s_datawidth(struct i2s_dev_s *dev, int bits);
static uint32_t nrf52_i2s_channel(struct i2s_dev_s *dev, int channel);
static int      nrf52_i2s_receive(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                                  i2s_callback_t callback, void *arg, uint32_t timeout);
static int      nrf52_i2s_send(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                               i2s_callback_t callback, void *arg,
                               uint32_t timeout);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* I2S device operations */

static const struct i2s_ops_s g_i2sops =
{
  /* Receiver methods */

  .i2s_rxsamplerate = nrf52_i2s_samplerate,
  .i2s_rxdatawidth  = nrf52_i2s_datawidth,
  .i2s_rxchannel    = nrf52_i2s_channel,
  .i2s_receive      = nrf52_i2s_receive,

  /* Transmitter methods */

  .i2s_txsamplerate = nrf52_i2s_samplerate,
  .i2s_txdatawidth  = nrf52_i2s_datawidth,
  .i2s_txchannel    = nrf52_i2s_channel,
  .i2s_send         = nrf52_i2s_send,
};

/* i2s status */
static struct nrf52_i2s_s g_nrf52_i2s_priv =
{
  .dev.ops     = &g_i2sops,
  .datalen     = CONFIG_NRF52_I2S_DEFAULT_DATALEN,
  .samplerate  = CONFIG_NRF52_I2S_DEFAULT_SAMPLERATE,
  .channel     = CONFIG_NRF52_I2S_DEFAULT_CHANNEL,
  .channel_setted = CONFIG_NRF52_I2S_DEFAULT_CHANNEL,
  .clk_config_current  = NULL,
  .clk_config_current  = NULL,
  .txenab = false,
  .rxenab = false,
  .loaded = NULL,
  .transmitting = NULL,
  .ended = NULL,

};

static const struct nrf52_i2s_clk_s nrf52_i2s_clk_table[] =
{
  {8000,  8,  NRF_I2S_SWIDTH_8BIT, NRF_I2S_MCK_32MDIV125, NRF_I2S_RATIO_32X},
  {11025, 8,  NRF_I2S_SWIDTH_8BIT, NRF_I2S_MCK_32MDIV15,  NRF_I2S_RATIO_192X},
  {16000, 8,  NRF_I2S_SWIDTH_8BIT, NRF_I2S_MCK_32MDIV31,  NRF_I2S_RATIO_64X},
  {22050, 8,  NRF_I2S_SWIDTH_8BIT, NRF_I2S_MCK_32MDIV30,  NRF_I2S_RATIO_48X},
  {32000, 8,  NRF_I2S_SWIDTH_8BIT, NRF_I2S_MCK_32MDIV32,  NRF_I2S_RATIO_32X},
  {44100, 8,  NRF_I2S_SWIDTH_8BIT, NRF_I2S_MCK_32MDIV15,  NRF_I2S_RATIO_48X},
  {48000, 8,  NRF_I2S_SWIDTH_8BIT, NRF_I2S_MCK_32MDIV21,  NRF_I2S_RATIO_32X},
  {96000, 8,  NRF_I2S_SWIDTH_8BIT, NRF_I2S_MCK_32MDIV10,  NRF_I2S_RATIO_32X},
  {8000,  16, NRF_I2S_SWIDTH_16BIT, NRF_I2S_MCK_32MDIV125, NRF_I2S_RATIO_32X},
  {11025, 16, NRF_I2S_SWIDTH_16BIT, NRF_I2S_MCK_32MDIV15,  NRF_I2S_RATIO_192X},
  {16000, 16, NRF_I2S_SWIDTH_16BIT, NRF_I2S_MCK_32MDIV31,  NRF_I2S_RATIO_64X},
  {22050, 16, NRF_I2S_SWIDTH_16BIT, NRF_I2S_MCK_32MDIV15,  NRF_I2S_RATIO_96X},
  {32000, 16, NRF_I2S_SWIDTH_16BIT, NRF_I2S_MCK_32MDIV32,  NRF_I2S_RATIO_32X},
  {44100, 16, NRF_I2S_SWIDTH_16BIT, NRF_I2S_MCK_32MDIV23,  NRF_I2S_RATIO_32X},
  {48000, 16, NRF_I2S_SWIDTH_16BIT, NRF_I2S_MCK_32MDIV21,  NRF_I2S_RATIO_32X},
  {96000, 16, NRF_I2S_SWIDTH_16BIT, NRF_I2S_MCK_32MDIV10,  NRF_I2S_RATIO_32X},
  {8000,  24, NRF_I2S_SWIDTH_24BIT, NRF_I2S_MCK_32MDIV42,  NRF_I2S_RATIO_96X},
  {11025, 24, NRF_I2S_SWIDTH_24BIT, NRF_I2S_MCK_32MDIV31,  NRF_I2S_RATIO_96X},
  {16000, 24, NRF_I2S_SWIDTH_24BIT, NRF_I2S_MCK_32MDIV42,  NRF_I2S_RATIO_48X},
  {22050, 24, NRF_I2S_SWIDTH_24BIT, NRF_I2S_MCK_32MDIV30,  NRF_I2S_RATIO_48X},
  {32000, 24, NRF_I2S_SWIDTH_24BIT, NRF_I2S_MCK_32MDIV21,  NRF_I2S_RATIO_48X},
  {44100, 24, NRF_I2S_SWIDTH_24BIT, NRF_I2S_MCK_32MDIV15,  NRF_I2S_RATIO_48X},
};

#define I2S_NULL_BUFFER_LENGTH 2
static uint32_t i2s_null_buffer[I2S_NULL_BUFFER_LENGTH] = {0, 0};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf52_i2s_getbitrate
 *
 * Description:
 *   Get the currently configured bitrate
 *
 * Input Parameters:
 *   priv   - private I2S device structure
 *
 * Returned Value:
 *   The current bitrate
 *
 ****************************************************************************/

static inline uint32_t nrf52_i2s_getbitrate(struct nrf52_i2s_s *priv)
{
  /* Calculate the bitrate in Hz */

  return 2 * priv->samplerate * priv->datalen;
}

/****************************************************************************
 * Name: nrf52_i2s_exclsem_take
 *
 * Description:
 *   Take the exclusive access semaphore handling any exceptional conditions
 *
 * Input Parameters:
 *   priv - A reference to the I2S peripheral state
 *
 * Returned Value:
 *  None
 *
 ****************************************************************************/

static void nrf52_i2s_exclsem_take(struct nrf52_i2s_s *priv)
{
  int ret;

  /* Wait until we successfully get the semaphore.  EINTR is the only
   * expected 'failure' (meaning that the wait for the semaphore was
   * interrupted by a signal).
   */

  do
    {
      ret = sem_wait(&priv->exclsem);
      DEBUGASSERT(ret == 0 || errno == EINTR);
    }
  while (ret < 0);
}


/****************************************************************************
 * Name: nrf52_i2s_reload
 *
 * Description:
 *   updata the TX/RX source/destination address of I2S peripheral, if the new
 *   buffer is NULL, we just stop the transreceive.
 *
 * Input Parameters:
 *   priv - nrf52 i2s device instance
 *   container -- new buffer that will be loaded to I2S peripheral
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 *
 ****************************************************************************/

static int nrf52_i2s_reload(struct nrf52_i2s_s *priv, struct i2s_buffer_s *container)
{
  struct ap_buffer_s *apb;
  uintptr_t samp;
  apb_samp_t nbytes;


