redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_i2s.c
  if (container)
    {
      apb = container->apb;

      /* Get the transfer information, accounting for any data offset */

      samp = (uintptr_t)&apb->samp[apb->curbyte];

      /* config tr/rx buffer */

      if (priv->txenab)
        {
          nbytes = apb->nbytes - apb->curbyte;
          DEBUGASSERT((samp & NRF52_I2S_DATA_ALIGN) == 0 && (nbytes & NRF52_I2S_DATA_ALIGN) == 0);

          /*reload TX buffer*/

          nrf_i2s_tx_buffer_set(NRF_I2S, (uint32_t *)samp);
          nrf_i2s_txrx_length_set(NRF_I2S, nbytes / 4);

        }
      else if (priv->rxenab)
        {
          nbytes = apb->nmaxbytes - apb->curbyte;
          DEBUGASSERT((samp & NRF52_I2S_DATA_ALIGN) == 0 && (nbytes & NRF52_I2S_DATA_ALIGN) == 0);

          /*reload RX buffer*/

          nrf_i2s_rx_buffer_set(NRF_I2S, (uint32_t *)samp);
          nrf_i2s_txrx_length_set(NRF_I2S, nbytes / 4);
        }

    }
  else
    {
      /* we need to load this buffer when we have nothing to send/receive, so that the currently
       * transmitting/receiving buffer will not be read/write twice.
       */
      if (priv->txenab)
        {
          /*reload TX buffer*/

          nrf_i2s_tx_buffer_set(NRF_I2S, (uint32_t *)i2s_null_buffer);
          nrf_i2s_txrx_length_set(NRF_I2S, I2S_NULL_BUFFER_LENGTH);

        }
      else if (priv->rxenab)
        {
          /*reload RX buffer*/

          nrf_i2s_rx_buffer_set(NRF_I2S, (uint32_t *)i2s_null_buffer);
          nrf_i2s_txrx_length_set(NRF_I2S, I2S_NULL_BUFFER_LENGTH);
        }

    }

  priv->ended = priv->transmitting;
  priv->transmitting = priv->loaded;
  priv->loaded = container;

  return OK;

}



/****************************************************************************
 * Name: nrf52_i2s_start
 *
 * Description:
 *   Setup and start i2s transfer
 *
 * Input Parameters:
 *   priv - nrf52 i2s device instance
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 * Assumptions:
 *   Interrupts are disabled and the I2S peripheral is in idle status
 *
 ****************************************************************************/
static int nrf52_i2s_start(struct nrf52_i2s_s *priv)
{
  struct i2s_buffer_s *bfcontainer;
  nrf_i2s_channels_t i2s_channel;
  irqstate_t flags;

  /* If there are no pending transfer, then bail returning success */

  if (sq_empty(&priv->pend))
    {
      return OK;
    }


  flags = enter_critical_section();

  bfcontainer = (struct i2s_buffer_s *)sq_remfirst(&priv->pend);
  DEBUGASSERT(bfcontainer && bfcontainer->apb);

  leave_critical_section(flags);

  /*set channel*/

  i2s_channel = (priv->channel_setted == 2) ? NRF_I2S_CHANNELS_STEREO : NRF_I2S_CHANNELS_LEFT;
  nrf_i2s_set_channel(NRF_I2S, i2s_channel);
  priv->channel = priv->channel_setted;

  /*set mck, swidth, ration register*/

  nrf_i2s_clk_width_set(NRF_I2S, priv->clk_config_setted->swidth,
                        priv->clk_config_setted->mck,
                        priv->clk_config_setted->ratio);
  priv->clk_config_current = priv->clk_config_setted;


  /*set the new buffer as the I2S TX/RX buffer*/

  nrf52_i2s_reload(priv, bfcontainer);

  if (priv->txenab)
    {
      /*enable i2s tx function and disable rx function*/

      nrf_i2s_tx_enable_set(NRF_I2S, true);
      nrf_i2s_rx_enable_set(NRF_I2S, false);
    }
  else
    {
      /*enable i2s rx function and disable tx function*/

      nrf_i2s_tx_enable_set(NRF_I2S, false);
      nrf_i2s_rx_enable_set(NRF_I2S, true);
    }

  /*enable i2s*/

  nrf_i2s_enable(NRF_I2S);

  /*trigger start task*/

  nrf_i2s_task_trigger(NRF_I2S, NRF_I2S_TASK_START);

  /*enable I2S interrupt*/

  up_enable_irq(I2S_IRQn);


  return OK;
}

/****************************************************************************
 * Name: nrf52_i2s_clear_worker
 *
 * Description:
 *   Transfer done worker
 *
 * Input Parameters:
 *   arg - the I2S device instance cast to void*
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void nrf52_i2s_clear_worker(void *arg)
{
  struct nrf52_i2s_s *priv = (struct nrf52_i2s_s *)arg;
  struct i2s_buffer_s *bfcontainer;
  irqstate_t flags;

  DEBUGASSERT(priv);

  /* Process each buffer in the done queue */

  while (sq_peek(&priv->done) != NULL)
    {
      /* Remove the buffer container from the done queue.  NOTE that
       * interupts must be enabled to do this because the done queue is
       * also modified from the interrupt level.
       */

      flags = enter_critical_section();
      bfcontainer = (struct i2s_buffer_s *)sq_remfirst(&priv->done);
      leave_critical_section(flags);

      /* Perform the transfer done callback */

      DEBUGASSERT(bfcontainer && bfcontainer->callback);
      bfcontainer->callback(&priv->dev, bfcontainer->apb,
                            bfcontainer->arg, bfcontainer->result);

      /* Release our reference on the audio buffer.  This may very likely
       * cause the audio buffer to be freed.
       */

      apb_free(bfcontainer->apb);

      /* And release the buffer container */

      nrf52_i2s_buf_free(priv, bfcontainer);
    }

}

/****************************************************************************
 * Name: nrf52_i2s_schedule
 *
 * Description:
 *   An transfer completion or timeout has occurred. Reload the TX/RX
 *   source/destination address and schedule the work in worker thread
 *   the working thread.
 *
 * Input Parameters:
 *   priv   - nrf52 i2s device instance
 *   result - The result of the transfer
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   - Interrupts are disabled
 *   - The timeout has been canceled.
 *
 ****************************************************************************/

static void nrf52_i2s_schedule(struct nrf52_i2s_s *priv, int result)
{
  struct i2s_buffer_s *bfcontainer;
  int ret;

  /*priv->loaded==NULL means we want to stop*/
  if (priv->loaded == NULL)
    {
      bfcontainer = NULL;
      /*priv->loaded == priv->transmitting ==NULL means we have already handled
       *the last meaningful buffer and we are OK to trigger the stop task.
       */
      if (priv->transmitting != NULL)
        {
          /*trigger STOP task*/
          nrf_i2s_task_trigger(NRF_I2S, NRF_I2S_TASK_STOP);

