redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_i2s.c
        }
    }
  else
    {
      /* If there are no pending transfer, then bail returning success */
      if (sq_empty(&priv->pend))
        {
          bfcontainer = NULL;
        }
      else
        {
          /*If the configration is changed, we will trigger a stop task and update the I2S
          register when we restart.*/
          if ((priv->channel_setted != priv->channel) ||
              (priv->clk_config_current != priv->clk_config_setted))
            {
              bfcontainer = NULL;
            }
          else
            {
              bfcontainer = (struct i2s_buffer_s *)sq_remfirst(&priv->pend);
            }
        }

    }

  nrf52_i2s_reload(priv, bfcontainer);


  /*priv->ended now pointed to the container which has just finished the transfer*/

  bfcontainer = priv->ended;

  if (bfcontainer != NULL)
    {
      /* Report the result of the transfer */

      bfcontainer->result = result;

      /* Add the completed buffer container to the tail of the done queue */

      sq_addlast((sq_entry_t *)bfcontainer, &priv->done);
    }

  /* If the worker has completed running, then reschedule the working thread.
   * REVISIT:  There may be a race condition here.  So we do nothing is the
   * worker is not available.
   */

  if ((!sq_empty(&priv->done)) && work_available(&priv->work))
    {
      /* Schedule the done processing to occur on the worker thread. */

      ret = work_queue(LPWORK, &priv->work, nrf52_i2s_clear_worker, priv, 0);
      if (ret != 0)
        {
          i2serr("ERROR: Failed to queue work: %d\n", ret);
        }
    }
}

/****************************************************************************
 * Name: nrf52_i2s_interrupt
 *
 * Description:
 *   This callback function is invoked at the completion of the I2S transfer.
 *
 * Input Parameters:
 *   handle - The DMA handler
 *   isr    - The interrupt status of the DMA transfer
 *   arg    - A pointer to the nrf52 i2s device instance
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
int nrf52_i2s_interrupt(int irq, FAR void *context, FAR void *arg)
{
  struct nrf52_i2s_s *priv = (struct nrf52_i2s_s *)arg;
  DEBUGASSERT(priv);

  if (nrf_i2s_event_check(NRF_I2S, NRF_I2S_EVENT_TXPTRUPD))
    {
      nrf_i2s_event_clear(NRF_I2S, NRF_I2S_EVENT_TXPTRUPD);
      i2sinfo("Event: %s.\r\n", (uint32_t)EVT_TO_STR(NRF_I2S_EVENT_TXPTRUPD));

      // If transmission is not enabled, but for some reason the TXPTRUPD
      // event has been generated, just ignore it.
      if (priv->txenab)
        {
          nrf52_i2s_schedule(priv, OK);
        }

    }

  if (nrf_i2s_event_check(NRF_I2S, NRF_I2S_EVENT_RXPTRUPD))
    {
      nrf_i2s_event_clear(NRF_I2S, NRF_I2S_EVENT_RXPTRUPD);
      i2sinfo("Event: %s.\r\n", (uint32_t)EVT_TO_STR(NRF_I2S_EVENT_RXPTRUPD));

      // If reception is not enabled, but for some reason the RXPTRUPD event
      // has been generated, just ignore it.
      if (priv->rxenab)
        {
          nrf52_i2s_schedule(priv, OK);
        }

    }

  /* we must handle the stopped event after TXPTRUPD/RXPTRUPD event*/
  if (nrf_i2s_event_check(NRF_I2S, NRF_I2S_EVENT_STOPPED))
    {
      nrf_i2s_event_clear(NRF_I2S, NRF_I2S_EVENT_STOPPED);
      i2sinfo("Event: %s.\r\n", (uint32_t)EVT_TO_STR(NRF_I2S_EVENT_STOPPED));

      nrf_i2s_disable(NRF_I2S);
      up_disable_irq(I2S_IRQn);
      nrf_i2s_tx_enable_set(NRF_I2S, false);
      nrf_i2s_rx_enable_set(NRF_I2S, false);

      priv->ended = NULL;
      priv->transmitting = NULL;
      priv->loaded = NULL;

      if (sq_empty(&priv->pend))
        {
          priv->txenab = false;
          priv->rxenab = false;
        }
      else
        {
          nrf52_i2s_start(priv);
        }
    }

  return OK;
}


/****************************************************************************
 * Name: nrf52_i2s_samplerate
 *
 * Description:
 *   Set the I2S RX/TX sample rate.
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   rate - The I2S sample rate in samples (not bits) per second
 *
 * Returned Value:
 *   Returns the resulting bitrate
 *
 ****************************************************************************/

static uint32_t nrf52_i2s_samplerate(struct i2s_dev_s *dev, uint32_t rate)
{
  struct nrf52_i2s_s *priv = (struct nrf52_i2s_s *)dev;
  int res;

  DEBUGASSERT(priv && rate > 0);

  /* set sample rate */
  res = nrf52_i2s_setbitrate(priv, rate, priv->datalen);

  if (res == OK)
    {

      /* Save the new data width */

      priv->samplerate = rate;
      return nrf52_i2s_getbitrate(priv);
    }
  else
    {
      i2serr("ERROR: Unsupported or invalid data sample rate: %d\n", rate);
      return 0;
    }

}

/****************************************************************************
 * Name: nrf52_i2s_datawidth
 *
 * Description:
 *   Set the I2S data width.  The bitrate is determined by
 *   2*sample_rate * data_width.
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *   width - The I2S data with in bits.
 *
 * Returned Value:
 *   Returns the resulting bitrate
 *
 ****************************************************************************/

static uint32_t nrf52_i2s_datawidth(struct i2s_dev_s *dev, int bits)
{
  struct nrf52_i2s_s *priv = (struct nrf52_i2s_s *)dev;
  int res;

  DEBUGASSERT(priv && bits >= 8);

  res = nrf52_i2s_setbitrate(priv, priv->samplerate, bits);

  if (res == OK)
    {

      /* Save the new data width */

      priv->datalen = bits;
      return nrf52_i2s_getbitrate(priv);
    }
  else
    {
      i2serr("ERROR: Unsupported or invalid data width: %d\n", bits);
      return 0;
    }
}

/****************************************************************************
 * Name: nrf52_i2s_channel
 *
 * Description:
 *   Set the I2S channel.  The bitrate is determined by
 *   2*sample_rate * data_width.
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *   channel - The I2S channel.
 *
 * Returned Value:
 *   Returns the resulting bitrate
 *
 ****************************************************************************/

static uint32_t nrf52_i2s_channel(struct i2s_dev_s *dev, int channel)
{
  struct nrf52_i2s_s *priv = (struct nrf52_i2s_s *)dev;

