redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_i2s.c
  DEBUGASSERT(priv && ((channel == 1) || (channel == 2)));

  /* Save the new data width */

  priv->channel_setted = (uint8_t)channel;
  return nrf52_i2s_getbitrate(priv);
}


/****************************************************************************
 * Name: nrf52_i2s_receive
 *
 * Description:
 *   Receive a block of data from I2S.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   apb      - A pointer to the audio buffer in which to recieve data
 *   callback - A user provided callback function that will be called at
 *              the completion of the transfer.  The callback will be
 *              performed in the context of the worker thread.
 *   arg      - An opaque argument that will be provided to the callback
 *              when the transfer complete
 *   timeout  - The timeout value to use.  The transfer will be canceled
 *              and an ETIMEDOUT error will be reported if this timeout
 *              elapsed without completion of the DMA transfer.  Units
 *              are system clock ticks.  Zero means no timeout.
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure.  NOTE:  This function
 *   only enqueues the transfer and returns immediately.  Success here only
 *   means that the transfer was enqueued correctly.
 *
 *   When the transfer is complete, a 'result' value will be provided as
 *   an argument to the callback function that will indicate if the transfer
 *   failed.
 *
 ****************************************************************************/

static int nrf52_i2s_receive(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                             i2s_callback_t callback, void *arg, uint32_t timeout)
{
  struct nrf52_i2s_s *priv = (struct nrf52_i2s_s *)dev;
  struct i2s_buffer_s *bfcontainer;
  irqstate_t flags;
  int ret;

  DEBUGASSERT(priv && apb);
  i2sinfo("apb=%p nbytes=%d arg=%p timeout=%d\n",
          apb, apb->nbytes - apb->curbyte, arg, timeout);

  /* Allocate a buffer container in advance */

  bfcontainer = nrf52_i2s_buf_allocate(priv);
  DEBUGASSERT(bfcontainer);

  /* Get exclusive access to the SAI driver data */

  nrf52_i2s_exclsem_take(priv);

  /* Verify not already TX'ing */

  if (priv->txenab)
    {
      i2serr("ERROR: i2s has no receiver\n");
      ret = -EAGAIN;
      goto errout_with_exclsem;
    }

  /* Add a reference to the audio buffer */

  apb_reference(apb);

  /*we should make the audio sample buffer align to word(32bit),
  because it's required by the hardware.*/

  /*apb_realign_to_word(apb);*/

  /* Initialize the buffer container structure */

  bfcontainer->callback = (void *)callback;
  bfcontainer->timeout  = timeout;
  bfcontainer->arg      = arg;
  bfcontainer->apb      = apb;
  bfcontainer->result   = -EBUSY;

  /* Add the buffer container to the end of the pending queue */

  flags = enter_critical_section();
  sq_addlast((sq_entry_t *)bfcontainer, &priv->pend);
  leave_critical_section(flags);

  /* Then start the next transfer.  If there is already a transfer in progess,
   * then this will do nothing.
   */
  if (priv->rxenab == false)
    {
      priv->rxenab = true;
      ret = nrf52_i2s_start(priv);
      DEBUGASSERT(ret == OK);
    }

  nrf52_i2s_exclsem_give(priv);

  return OK;

errout_with_exclsem:
  nrf52_i2s_exclsem_give(priv);
  nrf52_i2s_buf_free(priv, bfcontainer);
  return ret;
}


/****************************************************************************
 * Name: nrf52_i2s_send
 *
 * Description:
 *   Send a block of data on I2S.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   apb      - A pointer to the audio buffer from which to send data
 *   callback - A user provided callback function that will be called at
 *              the completion of the transfer.  The callback will be
 *              performed in the context of the worker thread.
 *   arg      - An opaque argument that will be provided to the callback
 *              when the transfer complete
 *   timeout  - The timeout value to use.  The transfer will be canceled
 *              and an ETIMEDOUT error will be reported if this timeout
 *              elapsed without completion of the DMA transfer.  Units
 *              are system clock ticks.  Zero means no timeout.
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure.  NOTE:  This function
 *   only enqueues the transfer and returns immediately.  Success here only
 *   means that the transfer was enqueued correctly.
 *
 *   When the transfer is complete, a 'result' value will be provided as
 *   an argument to the callback function that will indicate if the transfer
 *   failed.
 *
 ****************************************************************************/

static int nrf52_i2s_send(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                          i2s_callback_t callback, void *arg, uint32_t timeout)
{
  struct nrf52_i2s_s *priv = (struct nrf52_i2s_s *)dev;
  struct i2s_buffer_s *bfcontainer;
  irqstate_t flags;
  int ret;

  DEBUGASSERT(priv && apb);
  i2sinfo("apb=%p nbytes=%d arg=%p timeout=%d\n",
          apb, apb->nbytes - apb->curbyte, arg, timeout);

  /* Allocate a buffer container in advance */

  bfcontainer = nrf52_i2s_buf_allocate(priv);
  DEBUGASSERT(bfcontainer);

  /* Get exclusive access to the SAI driver data */

  nrf52_i2s_exclsem_take(priv);

  /* Verify not already RX'ing */

  if (priv->rxenab)
    {
      i2serr("ERROR: i2s has no transmitter\n");
      ret = -EAGAIN;
      goto errout_with_exclsem;
    }



  /* Add a reference to the audio buffer */

  apb_reference(apb);

  /*we should make the audio sample buffer align to word(32bit),
  because it's required by the hardware.*/

  /*apb_realign_to_word(apb);*/

  /* Initialize the buffer container structure */

  bfcontainer->callback = (void *)callback;
  bfcontainer->timeout  = timeout;
  bfcontainer->arg      = arg;
  bfcontainer->apb      = apb;
  bfcontainer->result   = -EBUSY;

  /* Add the buffer container to the end of the pending queue */

  flags = enter_critical_section();
  sq_addlast((sq_entry_t *)bfcontainer, &priv->pend);
  leave_critical_section(flags);

  /* Then start the next transfer.  If there is already a transfer in progess,
   * then this will do nothing.
   */
  if (priv->txenab == false)
    {
      priv->txenab = true;
      ret = nrf52_i2s_start(priv);
      DEBUGASSERT(ret == OK);
    }

  nrf52_i2s_exclsem_give(priv);

  return OK;

errout_with_exclsem:
  nrf52_i2s_exclsem_give(priv);
  nrf52_i2s_buf_free(priv, bfcontainer);
  return ret;
}

/****************************************************************************
 * Name: nrf52_i2s_bufsem_take
 *
 * Description:
 *   Take the buffer semaphore handling any exceptional conditions
 *
 * Input Parameters:
 *   priv - A reference to the I2S peripheral state
 *
 * Returned Value:
 *  None
 *
 ****************************************************************************/

static void nrf52_i2s_bufsem_take(struct nrf52_i2s_s *priv)
{
  int ret;

  /* Wait until we successfully get the semaphore.  EINTR is the only
   * expected 'failure' (meaning that the wait for the semaphore was
   * interrupted by a signal).
   */

  do
    {
      ret = sem_wait(&priv->bufsem);
      DEBUGASSERT(ret == 0 || errno == EINTR);
    }
  while (ret < 0);
}

/****************************************************************************
 * Name: nrf52_i2s_buf_allocate
 *
 * Description:
 *   Allocate a buffer container by removing the one at the head of the
 *   free list
 *
 * Input Parameters:
 *   priv - nrf52 i2s device instance
 *
 * Returned Value:
 *   A non-NULL pointer to the allocate buffer container on success; NULL if
 *   there are no available buffer containers.
 *
 * Assumptions:
 *   The caller does NOT have exclusive access to the nrf52 i2s device structure.
 *   That would result in a deadlock!
 *
 ****************************************************************************/

static struct i2s_buffer_s *nrf52_i2s_buf_allocate(struct nrf52_i2s_s *priv)
{
  struct i2s_buffer_s *bfcontainer;
  irqstate_t flags;

