redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_i2s.c
  /* Set aside a buffer container.  By doing this, we guarantee that we will
   * have at least one free buffer container.
   */

  nrf52_i2s_bufsem_take(priv);

  /* Get the buffer from the head of the free list */

  flags = enter_critical_section();
  bfcontainer = priv->freelist;
  ASSERT(bfcontainer);

  /* Unlink the buffer from the freelist */

  priv->freelist = bfcontainer->flink;
  leave_critical_section(flags);
  return bfcontainer;
}

/****************************************************************************
 * Name: nrf52_i2s_buf_free
 *
 * Description:
 *   Free buffer container by adding it to the head of the free list
 *
 * Input Parameters:
 *   priv - nrf52 i2s device instance
 *   bfcontainer - The buffer container to be freed
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   The caller has exclusive access to the nrf52 i2s device structure
 *
 ****************************************************************************/

static void nrf52_i2s_buf_free(struct nrf52_i2s_s *priv, struct i2s_buffer_s *bfcontainer)
{
  irqstate_t flags;

  /* Put the buffer container back on the free list */

  flags = enter_critical_section();
  bfcontainer->flink  = priv->freelist;
  priv->freelist = bfcontainer;
  leave_critical_section(flags);

  /* Wake up any threads waiting for a buffer container */

  nrf52_i2s_bufsem_give(priv);
}

/****************************************************************************
 * Name: nrf52_i2s_buf_initialize
 *
 * Description:
 *   Initialize the buffer container allocator by adding all of the
 *   pre-allocated buffer containers to the free list
 *
 * Input Parameters:
 *   priv - nrf52 i2s device instance
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called early in I2S initialization so that there are no issues with
 *   concurrency.
 *
 ****************************************************************************/

static void nrf52_i2s_buf_initialize(struct nrf52_i2s_s *priv)
{
  int i;

  priv->freelist = NULL;
  sem_init(&priv->bufsem, 0, CONFIG_NRF52_I2S_MAXINFLIGHT);

  for (i = 0; i < CONFIG_NRF52_I2S_MAXINFLIGHT; i++)
    {
      nrf52_i2s_buf_free(priv, &priv->containers[i]);
    }
}

/****************************************************************************
 * Name: nrf52_i2s_setbitrate
 *
 * Description:
 *   set i2s sample rate and simple width, biterate = 2*samplerate*samplewidth
 *
 * Input Parameter:
 *   priv - nrf52 i2s device instance
 *   samplerate - sample rate, 8000/16000/22050/32000/44100/48000/96000HZ
 *   samplewidth - sample width, 8/16/24bit
 *
 * Returned Value:
 *   OK - success
 *   -EINVAL - the samplerate or samplewidth is not supported by the hardware
 ****************************************************************************/
static int nrf52_i2s_setbitrate(struct nrf52_i2s_s *priv,
                                uint32_t samplerate, uint8_t samplewidth)
{
  const struct nrf52_i2s_clk_s *ptr = nrf52_i2s_clk_table;
  const struct nrf52_i2s_clk_s *end = (struct nrf52_i2s_clk_s *)nrf52_i2s_clk_table + \
                                      ARRAY_SIZE(nrf52_i2s_clk_table);

  while (ptr < end)
    {
      /*if we find the specified combination of sample rate and sample width
        in the table*/
      if ((ptr->samplerate == samplerate) && (ptr->samplewidth == samplewidth))
        {
          /*we cannot set the corresponding registers right now,
          because I2S may be executing a TX/RX task currently,
          we just updata this variable and handle it later on.*/
          priv->clk_config_setted = ptr;
          break;
        }
      else
        {
          ptr++;
        }
    }

  if (ptr < end)
    {
      return OK;
    }
  else
    {
      i2serr("ERROR: nrf52_i2s_set_bit_rate: specified combination of sample rate \
              and sample width is not supported!\n");
      return -EINVAL;
    }
}

/****************************************************************************
 * Name: nrf52_i2s_config
 *
 * Description:
 *   config i2s registers
 *
 * Input Parameter:
 *
 * Returned Value:
 *
 ****************************************************************************/

static void nrf52_i2s_config(void)
{
#ifdef CONFIG_NRF52_I2S_MODE_MASTER
  nrf_i2s_set_mode(NRF_I2S, NRF_I2S_MODE_MASTER);
#endif

#ifdef CONFIG_NRF52_I2S_MODE_SLAVE
  nrf_i2s_set_mode(NRF_I2S, NRF_I2S_MODE_SLAVE);
#endif

#if (defined CONFIG_NRF52_I2S_MODE_MASTER) || (defined CONFIG_NRF52_I2S_MCK_OUTPUT)
  nrf_i2s_set_mck_enable(NRF_I2S, true);
#else
  nrf_i2s_set_mck_enable(NRF_I2S, false);
#endif

#ifdef CONFIG_NRF52_I2S_FORMAT_ORIGINAL_I2S
  nrf_i2s_set_format(NRF_I2S, NRF_I2S_FORMAT_I2S);
#endif

#ifdef CONFIG_NRF52_I2S_FORMAT_ALIGNED
  nrf_i2s_set_format(NRF_I2S, NRF_I2S_FORMAT_ALIGNED);
#endif

#ifdef CONFIG_NRF52_I2S_ALIGN_LEFT
  nrf_i2s_set_align(NRF_I2S, NRF_I2S_ALIGN_LEFT);
#endif

#ifdef CONFIG_NRF52_I2S_ALIGN_RIGHT
  nrf_i2s_set_align(NRF_I2S, NRF_I2S_ALIGN_RIGHT);
#endif


  nrf_i2s_event_clear(NRF_I2S, NRF_I2S_EVENT_RXPTRUPD);
  nrf_i2s_event_clear(NRF_I2S, NRF_I2S_EVENT_TXPTRUPD);
  nrf_i2s_event_clear(NRF_I2S, NRF_I2S_EVENT_STOPPED);
  nrf_i2s_int_enable(NRF_I2S,
                     NRF_I2S_INT_RXPTRUPD_MASK | \
                     NRF_I2S_INT_TXPTRUPD_MASK | \
                     NRF_I2S_INT_STOPPED_MASK);

}

/****************************************************************************
 * Name: nrf52_i2s_config_pin
 *
 * Description:
 *   config pins used by i2s peripheral
 *
 * Input Parameter:
 *
 * Returned Value:
 *
 ****************************************************************************/

static void nrf52_i2s_config_pin(void)
{
  uint32_t mck_pin, sdout_pin, sdin_pin;


  // Configure pins used by the peripheral:

  // - SCK and LRCK (required) - depending on the mode of operation these
  //   pins are configured as outputs (in Master mode) or inputs (in Slave
  //   mode).

#ifdef CONFIG_NRF52_I2S_MODE_MASTER
  nrf_gpio_cfg_output(BOARD_I2S_SCK_PIN);
  nrf_gpio_cfg_output(BOARD_I2S_WS_PIN);
#endif

