redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_i2s.c
#ifdef CONFIG_NRF52_I2S_MODE_SLAVE
  nrf_gpio_cfg_input(BOARD_I2S_SCK_PIN,  NRF_GPIO_PIN_NOPULL);
  nrf_gpio_cfg_input(BOARD_I2S_WS_PIN, NRF_GPIO_PIN_NOPULL);
#endif


  // - MCK (optional) - always output,
  if (BOARD_I2S_MCK_PIN != NRF52_INVALID_GPIO_PIN)
    {
      mck_pin = BOARD_I2S_MCK_PIN;
      nrf_gpio_cfg_output(mck_pin);
    }
  else
    {
      mck_pin = NRF_I2S_PIN_NOT_CONNECTED;
    }

  // - SDOUT (optional) - always output,
  if (BOARD_I2S_SDOUT_PIN != NRF52_INVALID_GPIO_PIN)
    {
      sdout_pin = BOARD_I2S_SDOUT_PIN;
      nrf_gpio_cfg_output(sdout_pin);
    }
  else
    {
      sdout_pin = NRF_I2S_PIN_NOT_CONNECTED;
    }

  // - SDIN (optional) - always input.
  if (BOARD_I2S_SDIN_PIN != NRF52_INVALID_GPIO_PIN)
    {
      sdin_pin = BOARD_I2S_SDIN_PIN;
      nrf_gpio_cfg_input(sdin_pin, NRF_GPIO_PIN_NOPULL);
    }
  else
    {
      sdin_pin = NRF_I2S_PIN_NOT_CONNECTED;
    }

  nrf_i2s_pins_set(NRF_I2S, BOARD_I2S_SCK_PIN, BOARD_I2S_WS_PIN,
                   mck_pin, sdout_pin, sdin_pin);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf52_i2s_initialize
 *
 * Description:
 *   Initialize the nrf52 i2s driver
 *
 * Input Parameters:
 *
 * Returned Value:
 *   Valid I2S device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct i2s_dev_s *nrf52_i2s_initialize(void)
{
  struct nrf52_i2s_s *priv;
  int ret;

  i2sinfo("NRF52 i2s Initialize!\n");
  priv = &g_nrf52_i2s_priv;

  /* config peripheral registers */

  nrf52_i2s_config();

  /*set sample rate and sample width*/

  ret = nrf52_i2s_setbitrate(priv, priv->samplerate, priv->datalen);

  if (ret < 0)
    {
      i2serr("ERROR: nrf52 i2s configration failed!\n");
      goto err;
    }

  /* config pins used by the peripheral */

  nrf52_i2s_config_pin();

  sem_init(&priv->exclsem, 0, 1);

  /* Initialize queue */

  dq_init(&priv->pend);
  dq_init(&priv->done);

  /* Initialize buffering */

  nrf52_i2s_buf_initialize(priv);

  /* Attach the pdm interrupt */

  ret = irq_attach(I2S_IRQn, nrf52_i2s_interrupt, priv);
  if (ret < 0)
    {
      auderr("ERROR: I2S irq attach failed: %d\n", ret);
      goto err;
    }


  return &priv->dev;

err:
  return NULL;
}

#endif



